"use client";
import React, { useState } from "react";
import { Input } from "antd";
import { QuestionCircleOutlined } from "@ant-design/icons";
const { TextArea } = Input;

interface Bubble {
  title: string;
}

const Consultation = () => {
  const [bubbleList, setBubbleList] = useState<Bubble[]>([]);
  const [isVisible, setIsVisible] = useState(true);
  return (
    <div className={`absolute bottom-0 right-0 ${isVisible ? "h-full w-[400px]" : "h-16 w-16"} `}>
      <div className="relative h-full w-full transition-all delay-200 duration-100 ease-linear">
        <div className={`absolute ${isVisible ? "-top-4 left-6" : "left-0 top-0"} z-10 h-fit w-full `}>
          <div className="flex items-center justify-start gap-4 ">
            <div
              className={`flex ${
                isVisible ? "h-32 w-32 items-end" : "h-16 w-16 items-center"
              }  justify-center rounded-full bg-[#2C2B2B]   hover:cursor-pointer`}
              onClick={() => {
                setIsVisible(!isVisible);
              }}
            >
              <svg
                className={isVisible ? "fill-[#2C2B2B]  hover:animate-bounce" : ""}
                width="108"
                height="107"
                viewBox="0 0 108 107"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <mask id="mask0_507_2118" maskUnits="userSpaceOnUse" x="0" y="0" width="108" height="107">
                  <circle cx="53.8868" cy="53.566" r="53.434" fill="#D9D9D9" />
                </mask>
                <g mask="url(#mask0_507_2118)">
                  <path
                    d="M80.1449 11.812H51.3195C29.3768 11.812 11.585 29.3175 11.585 50.92V95.3354C11.585 100.113 15.5229 103.989 20.3774 103.989H20.8623C23.4521 103.989 25.5512 101.917 25.5512 99.3684V98.187C25.5512 96.2607 26.3435 94.5207 27.6266 93.2578C28.9097 91.9949 30.6836 91.2151 32.6407 91.2151C33.7464 91.2151 34.6393 92.0939 34.6393 93.1822V99.1124C34.6393 100.457 35.1951 101.679 36.0939 102.558C36.9926 103.442 38.2284 103.989 39.5943 103.989C42.2433 103.989 44.3896 101.871 44.3896 99.2637V90.2607C44.3896 89.2248 44.8213 88.2878 45.5072 87.6069C46.2049 86.926 47.1569 86.507 48.2094 86.507C50.8583 86.507 52.9988 88.6137 52.9988 91.2209V97.0755C52.9988 98.9843 53.7852 100.713 55.0565 101.964C56.3278 103.215 58.0839 103.989 60.0233 103.989C61.7913 103.989 63.2222 102.575 63.2222 100.835V97.9775C63.2222 96.2025 64.6886 94.7651 66.4861 94.7651H67.5977C68.7921 94.7651 69.7618 95.7137 69.7618 96.8951V101.289C69.7618 102.034 70.0693 102.709 70.566 103.198C71.0627 103.687 71.7486 103.989 72.5054 103.989C84.6091 103.989 94.4127 94.3344 94.4127 82.4275V25.8548C94.4127 18.0972 88.0208 11.812 80.1449 11.812ZM34.6452 60.2372C33.9771 60.2372 33.439 59.178 33.439 57.8744C33.439 56.5708 33.9771 55.5117 34.6452 55.5117C35.3075 55.5117 35.8455 56.5708 35.8455 57.8744C35.8455 59.178 35.3075 60.2372 34.6452 60.2372ZM39.4406 65.8822C38.2875 65.8822 37.3533 62.309 37.3533 57.8977C37.3533 53.4864 38.2875 49.9073 39.4406 49.9073C40.5995 49.9073 41.5337 53.4864 41.5337 57.8977C41.5337 62.309 40.5995 65.8822 39.4406 65.8822ZM45.7082 63.566C44.5552 63.566 43.621 60.8424 43.621 57.4845C43.621 54.1266 44.5552 51.403 45.7082 51.403C46.8612 51.403 47.7955 54.1266 47.7955 57.4845C47.7955 60.8424 46.8612 63.566 45.7082 63.566ZM50.9293 63.438C50.3558 63.438 49.8886 60.9588 49.8886 57.8977C49.8886 54.8366 50.3558 52.3516 50.9293 52.3516C51.5088 52.3516 51.9759 54.8366 51.9759 57.8977C51.9759 60.9588 51.5088 63.438 50.9293 63.438ZM55.5768 60.0102C54.5066 60.0102 53.6433 58.8405 53.6433 57.3972C53.6433 55.9481 54.5066 54.7784 55.5768 54.7784C56.6411 54.7784 57.5044 55.9481 57.5044 57.3972C57.5044 58.8405 56.6411 60.0102 55.5768 60.0102ZM60.449 63.438C59.7868 63.438 59.2487 60.9588 59.2487 57.8977C59.2487 54.8366 59.7868 52.3516 60.449 52.3516C61.1113 52.3516 61.6494 54.8366 61.6494 57.8977C61.6494 60.9588 61.1113 63.438 60.449 63.438ZM66.3797 65.8822C65.0493 65.8822 63.979 62.309 63.979 57.8977C63.979 53.4864 65.0493 49.9073 66.3797 49.9073C67.7041 49.9073 68.7744 53.4864 68.7744 57.8977C68.7744 62.309 67.7041 65.8822 66.3797 65.8822ZM72.7833 65.8822C71.8964 65.8822 71.175 62.309 71.175 57.8977C71.175 53.4864 71.8964 49.9073 72.7833 49.9073C73.6643 49.9073 74.3857 53.4864 74.3857 57.8977C74.3857 62.309 73.6643 65.8822 72.7833 65.8822ZM78.8086 63.7232C77.7679 63.7232 76.9283 60.9181 76.9283 57.4554C76.9283 53.9985 77.7679 51.1935 78.8086 51.1935C79.8492 51.1935 80.6889 53.9985 80.6889 57.4554C80.6889 60.9181 79.8492 63.7232 78.8086 63.7232ZM84.6446 32.7569C84.6446 38.239 80.133 42.6852 74.5631 42.6852H48.7238C43.1539 42.6852 38.6364 38.239 38.6364 32.7569V30.9179C38.6364 25.4358 43.1539 20.9954 48.7238 20.9954H74.5631C80.133 20.9954 84.6446 25.4358 84.6446 30.9179V32.7569Z"
                    fill="#30A549"
                  />
                  <path
                    d="M51.9752 40.6369C56.9128 40.6369 60.9155 36.6973 60.9155 31.8376C60.9155 26.9779 56.9128 23.0383 51.9752 23.0383C47.0376 23.0383 43.0349 26.9779 43.0349 31.8376C43.0349 36.6973 47.0376 40.6369 51.9752 40.6369Z"
                    fill="#27763B"
                  />
                  <path
                    d="M52.5189 38.2216C56.1012 38.2216 59.0053 35.3634 59.0053 31.8375C59.0053 28.3116 56.1012 25.4534 52.5189 25.4534C48.9365 25.4534 46.0325 28.3116 46.0325 31.8375C46.0325 35.3634 48.9365 38.2216 52.5189 38.2216Z"
                    fill="#3A3A3A"
                  />
                  <path
                    d="M51.9758 34.5142C53.478 34.5142 54.6957 33.3157 54.6957 31.8372C54.6957 30.3587 53.478 29.1602 51.9758 29.1602C50.4736 29.1602 49.2559 30.3587 49.2559 31.8372C49.2559 33.3157 50.4736 34.5142 51.9758 34.5142Z"
                    fill="white"
                  />
                  <path
                    d="M73.5636 40.6369C78.5012 40.6369 82.5039 36.6973 82.5039 31.8376C82.5039 26.9779 78.5012 23.0383 73.5636 23.0383C68.626 23.0383 64.6233 26.9779 64.6233 31.8376C64.6233 36.6973 68.626 40.6369 73.5636 40.6369Z"
                    fill="#27763B"
                  />
                  <path
                    d="M72.4632 38.2216C76.0456 38.2216 78.9497 35.3634 78.9497 31.8375C78.9497 28.3116 76.0456 25.4534 72.4632 25.4534C68.8809 25.4534 65.9768 28.3116 65.9768 31.8375C65.9768 35.3634 68.8809 38.2216 72.4632 38.2216Z"
                    fill="#3A3A3A"
                  />
                  <path
                    d="M71.9201 34.5142C73.4223 34.5142 74.64 33.3157 74.64 31.8372C74.64 30.3587 73.4223 29.1602 71.9201 29.1602C70.418 29.1602 69.2002 30.3587 69.2002 31.8372C69.2002 33.3157 70.418 34.5142 71.9201 34.5142Z"
                    fill="white"
                  />
                </g>
              </svg>
            </div>
            <span className={`mb-12 w-fit text-2xl ${isVisible ? "" : "hidden"} `}>諮詢怪物</span>
          </div>
        </div>
        <div
          className={`absolute right-0 top-10 h-[calc(100vh-180px)] w-[400px] rounded-xl bg-zinc-400/50 p-6 ${
            isVisible ? "" : "hidden"
          } overflow-y-scroll`}
        >
          <div className="flex flex-col gap-4 ">
            <div className="mt-14 flex w-full gap-3 overflow-x-auto">
              <button
                className="h-11 flex-shrink-0 rounded-xl bg-black p-2 text-white"
                onClick={() => {
                  setBubbleList((prev) => [...prev, { title: "New Bubble" }]);
                }}
              >
                添加泡泡
              </button>

              {bubbleList.length === 0 ? (
                <></>
              ) : (
                bubbleList.map((bubble, index) => {
                  return (
                    <span className="h-11 flex-shrink-0 rounded-xl border-2 border-black p-2" key={index}>
                      {bubble.title}
                    </span>
                  );
                })
              )}
            </div>
            <p className="text-lg">
              使用者名稱你好！我是你專屬的諮詢怪獸，讓我們一起生成專屬的探索泡泡，透過下方的對話窗跟我分享一些關於你的訊息，尋找有趣的學習主題吧！
            </p>
            <div className="flex gap-4 overflow-x-scroll">
              <div className="mt-4 h-36 w-72 flex-shrink-0 rounded-lg bg-white px-4 py-2">
                <div className="w-fit rounded-b-lg rounded-s-lg bg-green-500 px-4 text-3xl">TIP 1</div>
                <p className="ml-6 mt-2 w-[90%] text-2xl">您感興趣的活動有什麼呢？</p>
              </div>
              <div className="mt-4 h-36 w-72 flex-shrink-0 rounded-lg bg-white px-4 py-2">
                <div className="w-fit rounded-b-lg rounded-s-lg bg-green-500 px-4 text-3xl">TIP 1</div>
                <p className="ml-6 mt-2 w-[90%] text-2xl">您感興趣的活動有什麼呢？</p>
              </div>
            </div>
            <TextArea size="large" rows={6} placeholder="請輸入您的回覆…" />
            <button className="h-14 w-full rounded-lg bg-black text-center text-white">新專案</button>
            <div className="flex gap-4">
              <button className="h-12 w-20 rounded-lg border-2 border-black">
                <QuestionCircleOutlined style={{ fontSize: "24px" }} />
              </button>
              <button className="h-12 w-32 rounded-lg border-2 border-black">上一步</button>
              <button className="h-12 w-32 rounded-lg border-2 border-black">下一步</button>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Consultation;
